// "use strict "
// /*// Задание 2:
// // 1. Создайте переменную `num` и присвойте ей значение `123`. 
// Выведите значение этой переменной в консоль.
// // 2. Создайте переменную `а` и присвойте ей значение `5`, 
// переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.
// // 3. Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. 
// С помощью функции `console.log` выведите в консоль содержимое переменной `b`.
// // 4. Создайте два вида комментариев в вашем коде, 
// добавьте в них произвольный текст.
// // Тайминг: 20 минут.*/
// let num = 123;
// console.log(num);
// num = 18;
// console.log(num);
// const a = 125;
// console.log(a);

// /*// let s; is going to be underfined*/
// let s = 5;
// console.log(s);
// s = 7;

// let b = 1 + 2 + 3;
// console.log(b);



// // Задание 3: 
// // 1. Создайте две переменные, одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная будет хранить текущий год (все созданные переменные должны быть логично названы).
// // - Создайте переменную суммы и присвойте сумму чисел из двух переменных.
// // - Создайте переменную разности и присвойте разность текущего года и вашего возраста.
// // - Создайте переменную произведения и присвойте произведение чисел двух переменных.
// // - Создайте переменную частного и присвойте деление чисел текущего года к вашему возрасту.
// const myAge = 18;
// const thisYear = 2024;
// const sum = myAge + thisYear;
// const dif = thisYear - myAge;
// const mul = thisYear * myAge;
// const div = thisYear / myAge;

// // 2. Выведите в консоль все созданные переменные.
// console.log(sum, dif, mul, div);
// // 3. Сложите все созданные переменные и выведите результат в консоль.
// console.log(sum + dif + mul + div);
// // Тайминг: 20 минут.



// Задание 4: 
// Не запуская код, определите, что отобразится в консоли: 
// `let a = 5 + 5 * 3 + 3;` 23

// Не запуская код, определите, что отобразится в консоли:
// `let b = 8 / 2 + 2;` 6
// Не запуская код, определите, что отобразится в консоли:
// `let c = (2 + 3) * (2 + 3);` 25
// Не запуская код, определите, что отобразится в консоли:
// `let d = (2 + 3) * 2 + 3;` 13
// Не запуская код, определите, что отобразится в консоли:
// `let e = (2 * 8) / 4;` 4
// Не запуская код, определите, что отобразится в консоли:
// `let f = 2 * (8 / 4);` 4
// Тайминг: 20 минут.
// Задание 5: 
// 1. Запишите в переменную `a` число `0.1`, а в переменную `b` - число `0.2`. Найдите сумму значений этих переменных и выведите ее на экран.
// 2. Создайте переменную `c`, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.
// Тайминг: 5 минут.
let a = 0.1;
let b = 0.2;
console.log(a + b);
const c = 124.21545436;
console.log(c);
// console.log(Math.round(c));
// console.log(Math.floor(c));
// console.log(Math.ceil(c));
// console.log(Math.trunc(c));
// console.log(Math.round(c));
console.log(c * 100);

