 
 
/*1. Создайте массив с элементами 1, 2, 3. 
Выведите на экран каждый из этих элементов.*/
/*// Создаем массив с элементами 1, 2, 3
let myArray = [1, 2, 3];

// Выводим каждый элемент на экран
myArray.forEach(element => {
    console.log(element);
});/*



/*2. Создайте массив с произвольными элементами. 
Выведите на экран количество элементов в этом массиве.
// Создаем массив с произвольными элементами
let myArray = [10, 'строка', true, { key: 'value' }, 5.6];

// Выводим количество элементов на экран
console.log('Количество элементов в массиве: ' + myArray.length);*/


/*3. Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо первого элемента 
число 1, вместо второго - 2, вместо третьего - 3.
// Создаем массив с элементами 'a', 'b', 'c'
let myArray = ['a', 'b', 'c'];

// Заменяем элементы в массиве
myArray[0] = 1;
myArray[1] = 2;
myArray[2] = 3;

// Выводим измененный массив на экран
console.log(myArray);*/


 